hybridMultiphaseFoamV7/tutorials/FreeFlowCases/FlatPlateContactAngle/standardBoundary/0/alpha.wetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.wetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
92160
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    top
    {
        type            constantAlphaContactAngle;
        theta0          150;
        limit           gradient;
        value           uniform 0;
    }
    bottom
    {
        type            constantAlphaContactAngle;
        theta0          150;
        limit           gradient;
        value           nonuniform List<scalar> 
480
(
0
0
0
0
0
0
0
0
...
)
;
    }
    leftWall
    {
        type            fixedValue;
        value           uniform 0;
    }
    rightWall
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
